tap "dart-lang/dart"
tap "fwartner/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
brew "node"
brew "angular-cli"
brew "cocoapods"
brew "curl"
brew "deno"
brew "go"
brew "openjdk"
brew "kotlin"
brew "pnpm"
brew "rust"
brew "typescript"
brew "vite"
brew "wget"
brew "yarn"
brew "dart-lang/dart/dart"
cask "accessmenubarapps"
cask "android-file-transfer"
cask "anki"
cask "audacity"
cask "balenaetcher"
cask "barrier"
cask "blender"
cask "cd-to"
cask "copyq"
cask "discord"
cask "docker"
cask "epic-games"
cask "eul"
cask "figma"
cask "flutter"
cask "github"
cask "google-chrome"
cask "google-drive"
cask "hiddenbar"
cask "kap"
cask "keycastr"
cask "losslesscut"
cask "lulu"
cask "maczip"
cask "microsoft-edge"
cask "monitorcontrol"
cask "nitroshare"
cask "notion"
cask "obs"
cask "onedrive"
cask "open-video-downloader"
cask "openinterminal"
cask "qlvideo"
cask "rectangle"
cask "rustdesk"
cask "snipaste"
cask "squirrel"
cask "visual-studio-code"
cask "vlc"
cask "vmware-horizon-client"

# tap repositories and their packages
# brew python@3.10
# brew scrcpy
# https://tomlankhorst.nl/brew-bundle-restore-backup/
# brew bundle dump --file=~/Brewfile --force
# brew bundle
# App Store applications
# appstore 1432731683  Adblock Plus              (2.1.17)
# appstore 1037126344  Apple Configurator        (2.15.1)
# appstore 571213070   DaVinci Resolve           (17.4.6)
# appstore 425264550   Disk Speed Test           (3.4)
# appstore 1423210932  Flow                      (2.8.2)
# appstore 682658836   GarageBand                (10.4.6)
# appstore 408981434   iMovie                    (10.3.2)
# appstore 409183694   Keynote                   (12.0)
# appstore 539883307   LINE                      (7.8.1)
# appstore 1575588022  MenubarX                  (1.4.7)
# appstore 1295203466  Microsoft Remote Desktop  (10.7.6)
# appstore 1289197285  MindNode                  (2022.2.2)
# appstore 409203825   Numbers                   (12.0)
# appstore 409201541   Pages                     (12.0)
# appstore 1496833156  Playgrounds               (4.0)
# appstore 1484801884  pomodorome                (1.0.15)
# appstore 415166115   Typist                    (3.4.1)
# appstore 497799835   Xcode                     (13.3.1)
